# date:2023.07.22.02..21

# 左半屏，十位数，二进制
col1 = [
    0b00000000,0b01000000,0b01000000,0b01000000,0b01000000,0b01000000,0b00000000,0b00000000, # 1
    0b00000000,0b11100000,0b00100000,0b11100000,0b10000000,0b1110000000,0b00000000,0b00000000, # 2
    0b00000000,0b11100000,0b00100000,0b11100000,0b00100000,0b11100000,0b00000000,0b00000000, # 3
    0b00000000,0b10100000,0b10100000,0b11100000,0b00100000,0b00100000,0b00000000,0b00000000, # 4
    0b00000000,0b11100000,0b10000000,0b11100000,0b00100000,0b11100000,0b00000000,0b00000000, # 5
    0b00000000,0b11100000,0b10000000,0b11100000,0b10100000,0b11100000,0b00000000,0b00000000, # 6
    0b00000000,0b11100000,0b00100000,0b00100000,0b00100000,0b00100000,0b00000000,0b00000000, # 7
    0b00000000,0b11100000,0b10100000,0b11100000,0b10100000,0b11100000,0b00000000,0b00000000, # 8
    0b00000000,0b11100000,0b10100000,0b11100000,0b00100000,0b11100000,0b00000000,0b00000000, # 9
    0b00000000,0b11100000,0b10100000,0b10100000,0b10100000,0b11100000,0b00000000,0b00000000, # 0
]

# 右半屏，个位数，二进制
col2 = [
    0b00000000,0b00000010,0b00000010,0b00000010,0b00000010,0b00000010,0b00000000,0b00000000, # 1
    0b00000000,0b00000111,0b00000001,0b00000111,0b00000100,0b00000111,0b00000000,0b00000000, # 2
    0b00000000,0b00000111,0b00000001,0b00000111,0b00000001,0b00000111,0b00000000,0b00000000, # 3
    0b00000000,0b00000101,0b00000101,0b00000111,0b00000001,0b00000001,0b00000000,0b00000000, # 4
    0b00000000,0b00000111,0b00000100,0b00000111,0b00000001,0b00000111,0b00000000,0b00000000, # 5
    0b00000000,0b00000111,0b00000100,0b00000111,0b00000101,0b00000111,0b00000000,0b00000000, # 6
    0b00000000,0b00000111,0b00000001,0b00000001,0b00000001,0b00000001,0b00000000,0b00000000, # 7
    0b00000000,0b00000111,0b00000101,0b00000111,0b00000101,0b00000111,0b00000000,0b00000000, # 8
    0b00000000,0b00000111,0b00000101,0b00000111,0b00000001,0b00000111,0b00000000,0b00000000, # 9
    0b00000000,0b00000111,0b00000101,0b00000101,0b00000101,0b00000111,0b00000000,0b00000000, # 0
]

def format_binary(i, width): # esp8266固件format函数不可用，模拟format函数
    binary_str = bin(i)[2:]  # 将整数转换为二进制字符串，去掉前缀 '0b'
    padded_str = '0' * (width - len(binary_str)) + binary_str  # 使用 '0' 在左侧填充字符串至指定宽度
    return padded_str

def dec_to_hex(num): # 数字处理
    decimal_number = str(num)
    
    # 如果传入的是一位数字，则十位用0补全
    if len(decimal_number) == 1:
        ones_digit = int(decimal_number[0])
        tens_digit = 0
    else:
        ones_digit = int(decimal_number[1])
        tens_digit = int(decimal_number[0])

    list_col1= []
    list_col2 = []
    list_fin = []
    
    # 判断个位数是否为0
    if ones_digit == 0:
        for i in col2[72:80]:
            list_col2.append(format_binary(i, 8))
    else:
        for j in col2[ones_digit * 8 - 8:ones_digit * 8]:
            list_col2.append(format_binary(j, 8))
    
    # 判断十位数是否为0
    if tens_digit == 0:
        for a in col1[72:80]:
            list_col1.append(format_binary(a, 8))
    else:
        for b in col1[tens_digit * 8 - 8:tens_digit * 8]:
            list_col1.append(format_binary(b, 8))
            
    # 将个位数字和十位数字组合起来
    for k in range(8):
        comb = str(list_col1[k])[0:4] + str(list_col2[k][4:8])
        list_fin.append(comb)

    return list_fin

def num_proc(num): # 主函数
    if len(str(num)) >= 3: # 如果传入的数为三位数及以上则溢出，返回∞
        overflow_list = [0x00,0x66,0x99,0x99,0x66,0x00,0x00,0x00]
        return overflow_list
    else:
        listfin = dec_to_hex(num)
        list_fin_num = []
        for i in listfin:
            i = int(i,2)
            list_fin_num.append(i)
        return list_fin_num

#print(num_proc(163)) # 测试用
